luc-github/ESP3D/esp8266/webinterface.cpp
	int Tpos = web_interface->answer4M105.indexOf("T:");
	int slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
	int spacepos = web_interface->answer4M105.indexOf(" ",slashpos+1);
	if(slashpos!=-1 && spacepos!=-1 )
			{
			temperature = (int)atof(web_interface->answer4M105.substring(Tpos+2,slashpos).c_str());
			target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
			Tpos = web_interface->answer4M105.indexOf("T1:");
			if (Tpos>-1) description = "Extruder 1: ";
			else description = "Extruder : ";
			description += String(temperature);
			description += "/";
			if (target >0) description += String(target);
			else description += "off";
			TEMP_SVG(temperature,target,description)
			}
	//check for second extruder
	Tpos = web_interface->answer4M105.indexOf("T1:");
	if (Tpos>-1)
		{
		slashpos = web_interface->answer4M105.indexOf(" /",Tpos);
		spacepos = web_interface->answer4M105.indexOf(" ",slashpos+1);
		if(slashpos!=-1 && spacepos!=-1 )
			{
			temperature = (int)atof(web_interface->answer4M105.substring(Tpos+3,slashpos).c_str());
			target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
			description = "Extruder 2: ";
			description += String(temperature);
			description += "/";
			if (target >0) description += String(target);
			else description += "off";
			buffer2send+=(PROGMEM2CHAR(BR));
			TEMP_SVG(temperature,target,description)
			}
		}
	//check for bed
	Tpos = web_interface->answer4M105.indexOf("B:");
	if (Tpos>-1)
		{
		slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
		spacepos = web_interface->answer4M105.indexOf(" ",slashpos+1);
		if(slashpos!=-1 && spacepos!=-1 )
			{
			temperature = (int)atof(web_interface->answer4M105.substring(Tpos+2,slashpos).c_str());
			target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
			description = "Bed: ";
			description += String(temperature);
			description += "/";
			if (target >0) description += String(target);
			else description += "off";
			buffer2send+=(PROGMEM2CHAR(BR));
			TEMP_SVG(temperature*2,target*2,description)
			}
		}
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DIV_POSITION));
	int Epos = web_interface->answer4M114.indexOf("E:");
	description=web_interface->answer4M114.substring(0,Epos);
	description.replace("X:","<LABEL>X:</LABEL><LABEL class=\"text-info\">");
	description.replace("Y:","</LABEL><LABEL>&nbsp;&nbsp;Y:</LABEL><LABEL class=\"text-info\">");
	description.replace("Z:","</LABEL><LABEL>&nbsp;&nbsp;Z:</LABEL><LABEL class=\"text-info\">");
	buffer2send+=description;
	buffer2send+="</LABEL>&nbsp;&nbsp;";
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DIV_SPEED));
	buffer2send+=web_interface->answer4M220;
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DIV_FLOW));
	buffer2send+=web_interface->answer4M221;
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DIV_STATUS));
	STATUS_SVG(status_color)
	buffer2send+=(PROGMEM2CHAR(DIV_E));
	buffer2send+=(PROGMEM2CHAR(DATA_E));
	web_interface->WebServer.send(200, "text/html", buffer2send);
	
}

//URI Decoding function 
//no check if dst buffer is big enough to receive string so 
//use same size as src is a recommendation
void WEBINTERFACE_CLASS::urldecode(char *dst, const char *src)
{
  char a, b,c;
  if (dst==NULL) return;
  while (*src) {
    if ((*src == '%') &&
      ((a = src[1]) && (b = src[2])) &&
      (isxdigit(a) && isxdigit(b))) {
      if (a >= 'a')
        a -= 'a'-'A';
      if (a >= 'A')
        a -= ('A' - 10);
      else
        a -= '0';
      if (b >= 'a')
        b -= 'a'-'A';
      if (b >= 'A')
        b -= ('A' - 10);
      else
        b -= '0';
      *dst++ = 16*a+b;
      src+=3;
    } 
    else {
		c = *src++;
		if(c=='+')c=' ';
      *dst++ = c;
    }
  }
  *dst++ = '\0';
}


//constructor
WEBINTERFACE_CLASS::WEBINTERFACE_CLASS (int port):WebServer(port)
{
  //init what will handle "/"
  WebServer.on("/",HTTP_ANY, handle_web_interface_root);
  WebServer.on("/CONFIGSYS",HTTP_ANY, handle_web_interface_configSys);
  WebServer.on("/CONFIGAP",HTTP_ANY, handle_web_interface_configAP);
  WebServer.on("/CONFIGSTA",HTTP_ANY, handle_web_interface_configSTA);
  WebServer.on("/STATUS",HTTP_ANY, handle_web_interface_status);
  WebServer.on("/PRINTER",HTTP_ANY, handle_web_interface_printer);
  WebServer.onNotFound( handle_not_found);
  answer4M105="T:0 /0 ";
  answer4M114="X:0.0 Y:0.0 Z:0.0";
  answer4M220="100";
  answer4M221="100";
  last_temp=system_get_time();
}

WEBINTERFACE_CLASS * web_interface;

